DylanRowe88/NukCPGDrop/firmware/sdkconfig.defaults.e2e
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-8mb.csv"

CONFIG_FREERTOS_HZ=1000

CONFIG_I2C_USE_DMA=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_LWIP_DNS_CHECK_DOMAINS_REVERSE=n

CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# No PSRAM needed for DevKitC (has Quad PSRAM but we don't need it for E2E test)
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# Console via CH343 UART
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_BOARD_DEVKITC=y
CONFIG_E2E_TEST=y

# Minimal LVGL config (won't be initialized in E2E test mode)
CONFIG_LV_PREDEFINED_DISPLAY_NONE=y

CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=0
